In [2]:
import pandas as pd
import numpy as np

In [3]:
df_student = pd.DataFrame({'학생' : ['홍길동','이순신','갑돌이','갑순이','홍길순'], 
                           '전공' : ['경영학과','경영학과','간호학과','유아교육과','전자공학과']})

In [4]:
df_major = pd.DataFrame({'전공' : ['경영학과','간호학과','유아교육과','전자공학과'],
                         '담당교수' : ['저팔계','김영희','이철수','구씨'],
                         '강의실' : ['R502호','R603호','R605호','R203호']})

In [5]:
df_student

    학생     전공
0  홍길동   경영학과
1  이순신   경영학과
2  갑돌이   간호학과
3  갑순이  유아교육과
4  홍길순  전자공학과

In [6]:
df_major

      전공 담당교수    강의실
0   경영학과  저팔계  R502호
1   간호학과  김영희  R603호
2  유아교육과  이철수  R605호
3  전자공학과   구씨  R203호

In [7]:
all_df = pd.merge(df_student,df_major, on = '전공')

In [8]:
all_df

    학생     전공 담당교수    강의실
0  홍길동   경영학과  저팔계  R502호
1  이순신   경영학과  저팔계  R502호
2  갑돌이   간호학과  김영희  R603호
3  갑순이  유아교육과  이철수  R605호
4  홍길순  전자공학과   구씨  R203호

In [9]:
pd.merge(df_student,df_major, left_on = '전공', right_on = '전공')

    학생     전공 담당교수    강의실
0  홍길동   경영학과  저팔계  R502호
1  이순신   경영학과  저팔계  R502호
2  갑돌이   간호학과  김영희  R603호
3  갑순이  유아교육과  이철수  R605호
4  홍길순  전자공학과   구씨  R203호

In [10]:
import seaborn as sns
df = sns.load_dataset('tips')
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [11]:
df.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [12]:
df_gr = df.groupby(['day','time'])

In [13]:
a = df_gr.agg({'tip' : 'mean'})

In [14]:
a

                  tip
day  time
Thur Lunch   2.767705
     Dinner  3.000000
Fri  Lunch   2.382857
     Dinner  2.940000
Sat  Lunch        NaN
     Dinner  2.993103
Sun  Lunch        NaN
     Dinner  3.255132

In [15]:
a = a.fillna('-')

In [16]:
tip_gr = df.groupby('tip')

In [17]:
tip_gr.ngroups

123

In [18]:
tip_gr.groups.keys()

dict_keys([1.0, 1.01, 1.1, 1.17, 1.25, 1.32, 1.36, 1.44, 1.45, 1.47, 1.48, 1.5, 1.56, 1.57, 1.58, 1.61, 1.63, 1.64, 1.66, 1.67, 1.68, 1.71, 1.73, 1.75, 1.76, 1.8, 1.83, 1.92, 1.96, 1.97, 1.98, 2.0, 2.01, 2.02, 2.03, 2.05, 2.09, 2.18, 2.2, 2.23, 2.24, 2.3, 2.31, 2.34, 2.45, 2.47, 2.5, 2.52, 2.54, 2.55, 2.56, 2.6, 2.61, 2.64, 2.71, 2.72, 2.74, 2.75, 2.83, 2.88, 2.92, 3.0, 3.02, 3.06, 3.07, 3.08, 3.09, 3.11, 3.12, 3.14, 3.15, 3.16, 3.18, 3.21, 3.23, 3.25, 3.27, 3.31, 3.35, 3.39, 3.4, 3.41, 3.48, 3.5, 3.51, 3.55, 3.6, 3.61, 3.68, 3.71, 3.75, 3.76, 3.92, 4.0, 4.06, 4.08, 4.19, 4.2, 4.29, 4.3, 4.34, 4.5, 4.67, 4.71, 4.73, 5.0, 5.07, 5.14, 5.15, 5.16, 5.17, 5.2, 5.6, 5.65, 5.85, 5.92, 6.0, 6.5, 6.7, 6.73, 7.58, 9.0, 10.0])

In [19]:
tip_gr.groups[1.0]

Int64Index([67, 92, 111, 236], dtype='int64')

In [20]:
tip_gr.get_group(1.0).head()

     total_bill  tip     sex smoker  day    time  size
67         3.07  1.0  Female    Yes  Sat  Dinner     1
92         5.75  1.0  Female    Yes  Fri  Dinner     2
111        7.25  1.0  Female     No  Sat  Dinner     1
236       12.60  1.0    Male    Yes  Sat  Dinner     2

In [21]:
tip_new = df.groupby('smoker').agg({'tip':'mean'})

In [22]:
tip_new

             tip
smoker
Yes     3.008710
No      2.991854

In [23]:
tip_new.columns = ['tip_avg']

In [24]:
tip_new

         tip_avg
smoker
Yes     3.008710
No      2.991854

In [25]:
tip_time = df.groupby('time').agg({'tip':'mean'})

In [26]:
tip_time

             tip
time
Lunch   2.728088
Dinner  3.102670

In [27]:
df.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object